chap8/operations-and-related-topics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>operations-and-related-topics</title>
<!-- 2017-07-24 Mon 15:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Yu Zhao 赵宇" />
</head>
<body>
<div id="content">
<h1 class="title">operations-and-related-topics</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Operations and Related Topics</a>
<ul>
<li><a href="#sec-1-1">1.1. 8.1. Operators</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. assignment</a></li>
<li><a href="#sec-1-1-2">1.1.2. arithmetic operators</a></li>
<li><a href="#sec-1-1-3">1.1.3. bitwise operators</a></li>
<li><a href="#sec-1-1-4">1.1.4. logical (boolean) operators</a></li>
<li><a href="#sec-1-1-5">1.1.5. miscellaneous operators</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 8.2. Numerical Constants</a></li>
<li><a href="#sec-1-3">1.3. 8.3. The Double-Parentheses Construct</a></li>
<li><a href="#sec-1-4">1.4. 8.4. Operator Precedence</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Operations and Related Topics</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 8.1. Operators</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> assignment</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
= variable assignment. No spaces allowed.
</p>

<p>
注意 = 用作 test operator 时，两边要有括号
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;">#   </span><span style="color: #b22222;">=  as a test operator</span>

<span style="color: #a020f0;">if</span> [ <span style="color: #8b2252;">"$string1"</span> = <span style="color: #8b2252;">"$string2"</span> ]
<span style="color: #a020f0;">then</span>
   command
<span style="color: #a020f0;">fi</span>

<span style="color: #b22222;">#  </span><span style="color: #b22222;">if [ "X$string1" = "X$string2" ] is safer,</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">+ to prevent an error message should one of the variables be empty.</span>
<span style="color: #b22222;">#  </span><span style="color: #b22222;">(The prepended "X" characters cancel out.)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> arithmetic operators</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
算术运算符，经常出现在 expr 和 let 表达式中
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">+</td>
<td class="left">plus</td>
</tr>

<tr>
<td class="left">-</td>
<td class="left">minus</td>
</tr>

<tr>
<td class="left">*</td>
<td class="left">multiplication</td>
</tr>

<tr>
<td class="left">**</td>
<td class="left">exponentiation</td>
</tr>

<tr>
<td class="left">%</td>
<td class="left">modulo</td>
</tr>

<tr>
<td class="left">+=</td>
<td class="left">plus-equal</td>
</tr>

<tr>
<td class="left">-=</td>
<td class="left">minus-equal</td>
</tr>

<tr>
<td class="left">*=</td>
<td class="left">times-equal</td>
</tr>

<tr>
<td class="left">/=</td>
<td class="left">slash-equal</td>
</tr>

<tr>
<td class="left">%=</td>
<td class="left">mod-equal</td>
</tr>
</tbody>
</table>

<p>
++
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Bash, version 2.02, introduced the "**" exponentiation operator.</span>
<span style="color: #483d8b;">let</span> <span style="color: #8b2252;">"z=5**3"</span>    <span style="color: #b22222;"># </span><span style="color: #b22222;">5 * 5 * 5</span>
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"z = $z"</span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">z = 125</span>
</pre>
</div>

<pre class="example">
bash$ expr 5 % 3
2
bash$ expr 5 / 3
1
</pre>

<p>
% 操作符常用于: 生成某个范围内的常数，格式化程序的输出，生成素数。在数值运算中很常见
</p>

<p>
旧版本 bash 的 integer 范围是 -2147483648 ~ 2147483647, 超出这个范围的会报错
</p>

<pre class="example">
echo $BASH_VERSION   # 1.14

a=2147483646
echo "a = $a"        # a = 2147483646
let "a+=1"           # Increment "a".
echo "a = $a"        # a = 2147483647
let "a+=1"           # increment "a" again, past the limit.
echo "a = $a"        # a = -2147483648
                     #      ERROR: out of range,
                     # +    and the leftmost bit, the sign bit,
                     # +    has been set, making the result negative.
</pre>

<p>
bash 不理解含小数点的浮点数， bash 将含小数点的数理解为字符串
</p>

<pre class="example">
a=1.5
let "b = $a + 1.3"  # Error.
# t2.sh: let: b = 1.5 + 1.3: syntax error in expression
#                            (error token is ".5 + 1.3")
echo "b = $b"       # b=1
</pre>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> bitwise operators</h4>
<div class="outline-text-4" id="text-1-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&lt;&lt;</td>
<td class="left">按位左移</td>
</tr>

<tr>
<td class="left">&lt;&lt;=</td>
<td class="left">left-shift-equal 给定左移位数</td>
</tr>

<tr>
<td class="left">&gt;&gt;</td>
<td class="left">按位右移</td>
</tr>

<tr>
<td class="left">&gt;&gt;=</td>
<td class="left">right-shift-equal</td>
</tr>

<tr>
<td class="left">&amp;</td>
<td class="left">按位与</td>
</tr>

<tr>
<td class="left">&amp;=</td>
<td class="left">bitwise AND-equal</td>
</tr>

<tr>
<td class="left">&vert;</td>
<td class="left">bitwise OR</td>
</tr>

<tr>
<td class="left">&vert;=</td>
<td class="left">bitwise OR-equal</td>
</tr>

<tr>
<td class="left">~</td>
<td class="left">bitwise NOT</td>
</tr>

<tr>
<td class="left">^</td>
<td class="left">bitwise XOR</td>
</tr>

<tr>
<td class="left">^=</td>
<td class="left">bitwise XOR-equal</td>
</tr>
</tbody>
</table>

<p>
在 bash 脚本中 bitwise operators 比较少见，但是在 base64.sh 中有精巧的应用
</p>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> logical (boolean) operators</h4>
<div class="outline-text-4" id="text-1-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">!</td>
<td class="left">NOT</td>
</tr>

<tr>
<td class="left">&amp;&amp;</td>
<td class="left">AND</td>
</tr>

<tr>
<td class="left">&vert;&vert;</td>
<td class="left">OR</td>
</tr>
</tbody>
</table>


<p>
NOT 用法
</p>
<pre class="example">
if [ ! -f $FILENAME ]
then
  ...
</pre>

<p>
AND 用法
</p>
<pre class="example">
if [ $condition1 ] &amp;&amp; [ $condition2 ]
#  Same as:  if [ $condition1 -a $condition2 ]
#  Returns true if both condition1 and condition2 hold true...

if [[ $condition1 &amp;&amp; $condition2 ]]    # Also works.
#  Note that &amp;&amp; operator not permitted inside brackets
#+ of [ ... ] construct.
</pre>

<p>
OR 用法
</p>
<pre class="example">
if [ $condition1 ] || [ $condition2 ]
# Same as:  if [ $condition1 -o $condition2 ]
# Returns true if either condition1 or condition2 holds true...

if [[ $condition1 || $condition2 ]]    # Also works.
#  Note that || operator not permitted inside brackets
#+ of a [ ... ] construct.
</pre>

<p>
在算术运算上下文中：
</p>
<pre class="example">
echo $(( 1 &amp;&amp; 2 )) $((3 &amp;&amp; 0)) $((4 || 0)) $((0 || 0))
</pre>
</div>
</div>

<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> miscellaneous operators</h4>
<div class="outline-text-4" id="text-1-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">,</td>
<td class="left">Comma operator</td>
</tr>
</tbody>
</table>
<p>
逗号操作符将两个或多个算术运算符相连，所有的操作都被执行
返回最后一个的结果，前面的都是 side effects
</p>

<pre class="example">
let "t1 = ((5 + 3, 7 - 1, 15 - 4))"
echo "t1 = $t1"           ^^^^^^  # t1 = 11
# Here t1 is set to the result of the last operation. Why?
let "t2 = ((a = 9, 15 / 3))"      # Set "a" and calculate "t2".
echo "t2 = $t2    a = $a"         # t2 = 5    a = 9
</pre>

<p>
逗号操作符主要用于 for 循环，参见<a href="../chap11/11-13.sh">Example 11-13</a>
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 8.2. Numerical Constants</h3>
<div class="outline-text-3" id="text-1-2">
<p>
数字默认为十进制，以0开头的为八进制，以0x开头的为十六进制，还可以用 embedded # 的形式
指定进制， 如 2#101010 为二进制，8#16 为八进制， 16#EF 为十六进制，还可以为 32#，15#，64# 等等
</p>

<pre class="example">
$ let "a = 8#16"
$ echo $a
14
</pre>
<p>
<a href="8-4.sh">8-4.sh</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 8.3. The Double-Parentheses Construct</h3>
<div class="outline-text-3" id="text-1-3">
<p>
双括号允许算术运算和求值
$ a=$(( 5 + 3 ))
也允许 C 形式的变量操作
$ (( var++ ))
<a href="8-5.sh">8-5.sh</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 8.4. Operator Precedence</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="http://tldp.org/LDP/abs/html/opprecedence.html">http://tldp.org/LDP/abs/html/opprecedence.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yu Zhao 赵宇</p>
<p class="date">Created: 2017-07-24 Mon 15:40</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
